IdeaRS.OpenModel.Connection.WeldType
enum of weld types

IdeaRS.OpenModel.Connection.WeldType.NotSpecified
NotSpecified

IdeaRS.OpenModel.Connection.WeldType.Fillet
Fillet

IdeaRS.OpenModel.Connection.WeldType.DoubleFillet
DoubleFillet

IdeaRS.OpenModel.Connection.WeldType.Bevel
Bevel

IdeaRS.OpenModel.Connection.WeldType.Square
Square

IdeaRS.OpenModel.Connection.WeldType.Plug
Plug

IdeaRS.OpenModel.Connection.WeldType.LengthAtHaunch
LengthAtHaunch

IdeaRS.OpenModel.Connection.WeldType.FilletRear
FilletRear

IdeaRS.OpenModel.Connection.WeldType.Contact
Contact

IdeaRS.OpenModel.Connection.WeldType.Intermittent
Intermittent